[
  {
    "id": 1,
    "title": "MacBook Pro 13 inch (2019) - QWERTY - English",
    "price": 537.00,
    "description": "Reborn electronics are like new — just better for the planet and your pocket. Our sellers are electronics experts who test and verify that every device is clean and 100% functional before it goes out for delivery. You get what it says on the box or your money back.",
    "category": "Apple",
    "image": "./images/mac1.jpg",
    "rating": { "rate": 4.5, "count": 999 }
  },
  {
    "id": 2,
    "title": "Apple MacBook Pro 15.4 inch Intel Core i7, 8GB RAM - 256GB SSD (ME293LL/A) Late 2013 - Silver",
    "price": 279.99,
    "description": "The amazing 15.4 inch Retina display of the Apple MacBook Pro A1398 notebook has a resolution of 2880 x 1800 pixels that offers the wide color gamut, fine contrast and sharp edges. You can perform your everyday tasks at lightning fast speeds as this Apple notebook features a 2 GHz quad-core i7 processor. Moreover, the 256 GB hard drive capacity of this MacBook allows you to store all your important data and media content.",
    "category": "Apple",
    "image": "./images/mac2.jpg",
    "rating": { "rate": 2.7, "count": 101 }
  },
  {
    "id": 3,
    "title": "MacBook Air 13.3 inch Laptop - Apple M1 chip - 8GB Memory - 256GB SSD - Space Gray",
    "price": 799.99,
    "description": "Apple’s thinnest and lightest notebook gets supercharged with the Apple M1 chip. Tackle your projects with the blazing-fast 8-core CPU. Take graphics-intensive apps and games to the next level with the 7-core GPU. And accelerate machine learning tasks with the 16-core Neural Engine. All with a silent, fanless design and the longest battery life ever — up to 18 hours.¹ MacBook Air. Still perfectly portable. Just a lot more powerful.",
    "category": "Apple",
    "image": "./images/mac3.jpg",
    "rating": { "rate": 4.8, "count": 559 }
  },
  {
    "id": 4,
    "title": "Apple MacBook Pro with Retina display - Core i5 2.4 GHz - macOS Catalina 10.15 - 4 GB RAM - 128 GB flash storage",
    "price": 365.00,
    "description": "A groundbreaking Retina display. All-flash architecture. The latest Intel processors. Remarkably thin and light design. Together, these features take the notebook to a place it's never been. And they'll do the same for everything you create with it.",
    "category": "Apple",
    "image": "./images/mac4.jpg",
    "rating": { "rate": 3.8, "count": 430 }
  },
  {
    "id": 5,
    "title": "Dell - Inspiron 2-in-1 14 inch FHD+ Touch Laptop – 12th Gen Intel Core i7 – 16GB Memory – 512GB SSD - Platinum Silver",
    "price": 849.99,
    "description": "From the moment you turn on your Inspiron, you’re greeted and connected to a whole new world. Whether it's social media, streaming movies, or finishing your work, Inspiron 14 2-in-1 laptop delivers what matters most to you, in style. Experience amazing visuals and audio in any mode. Features a 16:10 aspect ratio FHD+ display, Waves MaxxAudio Pro and the latest AMD Mobile Processors with Radeon Graphics",
    "category": "Dell",
    "image": "./images/dell1.jpg",
    "rating": { "rate": 4.5, "count": 400 }
  },
  {
    "id": 6,
    "title": "Dell Latitude 7390 13.3 inch 2-in-1 Touchscreen Laptop i7-8650U - Windows 10 - Grade B ",
    "price": 279.99,
    "description": "The Dell Latitude 7390 2-in-1 Touchscreen Laptop is a powerful machine that is fully capable of any task. This features an 8th generation core i7 and two Thunderbolt 3 USB C ports of all your adapters. Dell's redesigned latitude entry into 2-in-1 is an all-around improvement in design, features and performance, making it one of the best in the category. The included NVMe PCIe SSD allows for superior speeds and fast booting to your essential programs.",
    "category": "Dell",
    "image": "./images/dell2.jpg",
    "rating": { "rate": 3.9, "count": 70 }
  },
  {
    "id": 7,
    "title": "Dell Precision 3520 i7-6820 Nvidia 15.6 inch Workstation",
    "price": 550.00,
    "description": "This laptop was made to work! The Dell Precision 3520 Ultrabook Workstation takes on serious architecture, graphics, scientific, and engineering tasks with ease. It's powerful enough to emulate desktop performance and portable enough to be taken anywhere.",
    "category": "Dell",
    "image": "./images/dell3.jpg",
    "rating": { "rate": 3, "count": 400 }
  },
  {
    "id": 8,
    "title": "Dell Latitude 7000 7530 15.6 inch Notebook - Full HD - 1920 x 1080 - Intel Core i7 12th Gen i7-1270P Dodeca-core (12 Core)",
    "price": 1391.99,
    "description": "Work confidently from anywhere on the world's smallest and lightest 15 inch premium commercial laptop. More premium choices provide an amazing screen experience, intelligent performance, built-in security, and privacy.",
    "category": "Dell",
    "image": "./images/dell4.jpg",
    "rating": { "rate": 4.3, "count": 907 }
  },
  {
    "id": 9,
    "title": "ThinkPad T14s Gen 2 Intel (14”) - Black",
    "price": 1049.99,
    "description": "Whether it’s a touchscreen you prefer or a traditional display, the ThinkPad T14s Gen 2 laptop gives you a number of 14 inch screen choices based on your needs—and all options include thin bezels that enhance the display. Choose the low-power FHD panel for ultimate battery life, or go with the FHD wide-angle touchscreen. For refined details, increased brightness, and amazingly accurate colors, dramatic Dolby Vision™ IPS high-dynamic-range (HDR) technology is available on the 4K display.",
    "category": "Lenovo",
    "image": "./images/lenovo1.jpg",
    "rating": { "rate": 3.3, "count": 203 }
  },
  {
    "id": 10,
    "title": "IdeaPad Flex 5 (14 inch AMD) - Cloud Grey",
    "price": 539.99,
    "description": "AMD Ryzen™ 7 U Series Mobile Processors give the performance you need for content creation and productivity. 8GB LPDDR4x memory and 512GB PCle SSD storage offer faster read and write speeds, with storage for all of your files. Intelligent Cooling ensures cool temps and quiet fan noise; balance your sessions to optimize battery life or bolster performance with Lenovo's AI technology.",
    "category": "Lenovo",
    "image": "./images/lenovo2.jpg",
    "rating": { "rate": 2.9, "count": 470 }
  },
  {
    "id": 11,
    "title": "Surface Laptop 5 - 13.5 inch, Platinum (Alcantara®), 12th Gen Intel® Core™ i5, 8GB RAM, 256GB SSD",
    "price": 899.99,
    "description": "Multitasking speed powered by 12th Gen Intel® Core™ i5/i7 processors built on the Intel® Evo™ platform, with Windows 11 and a vibrant touchscreen. Sleek and beautiful, in your choice of size.¹ And battery life² for real life to do your thing your way all day. Surface Laptop 5 gives you the perfect balance to do it all.",
    "category": "HP",
    "image": "./images/hp1.jpg",
    "rating": { "rate": 4.8, "count": 319 }
  },
  {
    "id": 12,
    "title": "HP Elitebook 840 G3 Laptop Intel i5-6600U 2.6GHz, 8GB RAM, 512GB SSD, Windows 10 Pro (Reused)",
    "price": 242.78,
    "description": "HP Elitebook 840 G3 Laptop Intel i5-6600U 2.6GHz, 8GB RAM, 512GB SSD, Windows 10 Pro",
    "category": "HP",
    "image": "./images/hp2.jpg",
    "rating": { "rate": 4.8, "count": 400 }
  }
]
  